[
  {
    "title": "21.05.2021",
    "text": "<p>По просьбе пользователей в фильтре планировщика список дней увеличен с 14 до 30.</p>"
  },
  {
    "title": "20.05.2021",
    "text": "<p>Маркеры изменены немного: теперь они в виде иконок с всплывающими подсказками. Немного подправлен мобильный вид сайта. Добавлено автоматическая интеграция с quizy.pro - теперь их игры обновляются каждый час.</p>"
  },
  {
    "title": "11.05.2021",
    "text": "<p>Добавлена возможность выставлять маркеры на игры в списке планировщика ЧГК и фильтровать по этим маркерам.</p>"
  },
  {
    "title": "04.05.2021",
    "text": "<p>Много изменений на сайте. Весь мотор переделан в современный вид приложения на VueJS. Добавлены API сервисы. Много новых фильтров (редакторы, дата, сложность, тип турнира) в планировщике и вид таблицей. Там же можно отслеживать игры по ID игрока.</p><p>Изменения и в списке онлайн игр - слева появился навигатор по дате. Фильтр немного поменялся, но в целом остался таким же.</p>"
  },
  {
    "title": "22.04.2021",
    "text": "<p>На сайт добавлен <a href=\"/chgkplan\">планировщик ЧГК игр</a> на основе данных рейтинга ЧГК.</p>"
  },
  {
    "title": "20.09.2020",
    "text": "<p>Табами отделены разные ресурсы: дополнительные отдельно, франшизы, которые перестали выпускать онлайн-игры, активные франшизы.</p>"
  },
  {
    "title": "12.05.2020",
    "text": "<p>Обновлён дизайн списка - убрал пестроту и сблизил строки. Добавлен подсчёт игр за каждый день (серым под датой). И добавлен общий подсчёт активных игр и ресурсов в названия табов.</p>"
  },
  {
    "title": "09.05.2020",
    "text": "<p>Обновлён дизайн списка. Время вынесено в заголовок группы квизов с одним и тем же временем. Из каждой строки время перенесено в менее заметное место, но на всякий случай дублирует подзаголовок.</p>"
  },
  {
    "title": "03.05.2020",
    "text": "<p>Последние 3 недели идёт разработка по переносу всех данных из репозитория в базу данных, и вместе с этим какой-то веб-интерфейс для удобного добавления данных через форму. К сожалению, это не сделать достаточно быстро. Работаю.</p><p>При этом растёт количество данных, поэтому начал архивировать их по месяцам. Старые игры за март и апрель теперь не подгружаются каждый раз с активными. Они заархивированы на всякий случай и удалены из активных подгрузок.</p><p>Также подгрузка данных из нескольких десятков файлов сделана в этапы по группам. Не всё разом, а по 20-30 за раз. Это немного снимает разовую нагрузку. С базой данных эта проблема совсем исчезнет.</p>"
  },
  {
    "title": "11.04.2020",
    "text": "<p>Убрана плашка \"Есть регистрация\" - в большинстве случаев она нужна, поэтому теперь наобот. Если ничего нет, то регистрация есть или неизвестно, и вдобавок есть плашка \"Нет регистрации\". Для ссылок сделаны нормальные тексты. Теперь лучше видно, куда перенаправит ссылка.</p>"
  },
  {
    "title": "07.04.2020",
    "text": "<p>Случились первые проблемы с Github Pages (я не ожидал их так рано), поэтому страница была срочно перенесена на <a href=\"https://quiza.stalnuhhin.ee\">quiza.stalnuhhin.ee</a>. В связи с этим заодно сменил репозиторий с github.com/stalnuhhin/quiz на github.com/stalnuhhin/quiza. В старый репозиторий добавил страничку с информацией о переезде.</p>"
  },
  {
    "title": "06.04.2020",
    "text": "<p>Добавлена разная сортировка в список франшиз, и по умолчанию выставлено \"по алфавиту\". Также подправлена сортировка в других списках.</p>"
  },
  {
    "title": "05.04.2020",
    "text": "<p>Добавлен фильтр для показа игр в формате \"Что? Где? Когда?\" (ЧГК).</p><p>Кроме Google Analytics добавлен ещё один счётчик (открытый всем) в самый низ странички. Оба счётчика могут быть заблокированы плагинами браузеров, так что показывают в некоторой степени заниженные данные.</p><p>В ресурсах сделаны небольшие изменения - теперь там нет дубликатов в данных. Заодно решено сделать отслеживание по дате крайней игры в базе, а не по дате проверки - чтобы не терять время на те франшизы, которые сильно заранее добавляют расписание игр (за что им спасибо).</p><p>Обновлен отдел \"О страничке\".</p>"
  },
  {
    "title": "04.04.2020",
    "text": "<p>Добавлен фильтр для показа только бесплатных игр.</p>"
  },
  {
    "title": "03.04.2020",
    "text": "<p>За два дня появилось так много квизов, что понадобилось придумать другую структуру данных. Перелопатил все данные и разложил по полочкам. Теперь у каждой франшизы есть свой файлик с данными. Также оптимизировал хранение некоторых общих данных.</p><p>Добавлена закладка \"Новости\", в которую планируется выписывать все изменения на данной страничке.</p>"
  },
  {
    "title": "02.04.2020",
    "text": "<p>Добавлена страничка \"Ресурсы\" со списком на сканируемые и дополнительные ресурсы. Для сканируемых есть также дата последней проверки ресурса на наличие новых игр.</p>"
  },
  {
    "title": "01.04.2020",
    "text": "<p>Поделился ссылкой на систему в социальной сети. Получил положительные отзывы, пять франшиз связались по поводу добавления их данных в систему.</p>"
  },
  {
    "title": "30.03.2020",
    "text": "<p>Создан проект на Github. Я хотел написать небольшую удобную страничку для отслеживания интеллектуальных онлайн игр. Увлёкся и начал добавлять необязательные элементы, которые пригодились бы, например, пользователям в других часовых поясах.</p>"
  }
]
